[
    {
        "blog_id": 1491,
        "title": "5 Tips for First Time Contact Lens Wearers",
        "thumbnail": "https://www.news-medical.net/image.axd?picture=2018%2F9%2Fshutterstock_266735645.jpg",
        "published_date": "July 01, 2021",
        "author": "Laila Torphy",
        "details": "Congratulations on getting your first pair of contact lenses! If you’re like most people, you’ll probably spend the first few days marveling at small visual details that you never noticed before—like dew on the grass and small specks of color on bright green leaves.It’s a very exciting time but, as with anything new, it might be a little intimidating too. After all, contact lenses are high-tech medical devices and your vision is one of your most valued senses. As such, it’s important to make good choices for the health and comfort of your eyes. Here are five tips designed to put you on the path to a lifetime of success with your new contact lenses.1. Relax. Lots of people worry that they’ll scratch their eyes while putting their lenses on or—worse—that the contact lens will get stuck behind their eye. Relax. Applying and removing lenses might make you nervous at first, but as awkward as it may seem, there is no need to be afraid to touch your eye as long as your hands are clean. Plus, the inside of your eyelids are connected to the back of your eye, so your lenses can’t possibly slip into an abyss.2. Keep lenses clean. For monthly/2-week products, don’t take shortcuts with lens cleaning. Your doctor will give you instructions that are specific to the lens care regime that is chosen for you. For example, if you are told to use a multipurpose solution every time you remove your lenses, you should rub and rinse and then place them into fresh solution. Don’t just top off the solution that’s already in the case. When you put your lenses on in the morning, empty out the case completely, rinse with fresh solution and leave it uncapped and upside down on a paper towel to air dry. Your lens case should be replaced every 3 months. Interested in a fresh pair of lenses every morning that doesn’t require cleaning? Ask your doctor for a daily disposable, such as MyDay® daily disposable or clariti® 1 day. These lenses can be thrown out every night and exchanged for a fresh new pair each morning, eliminating cleaning and storage concerns.4. Follow your doctor’s recommendations. Use only the products that are recommended by your eye doctor. Don’t substitute lens care product without checking with your doctor first. The solution you have was chosen specifically for your type of lens, so don’t make assumptions based on broadly-defined packaging labels. It’s also important to keep your appointments. Whatever follow-up schedule your doctor sets, stick to it.Learning how to do anything new takes time. In fact, it may take about a week until you adapt to your new life with contact lenses and feel truly confident2. But, before you know it, contact lenses will become a valued part of your life."
    },
    {
        "blog_id": 1492,
        "title": "Is Hitting the Books Hurting Your Eyes?",
        "thumbnail": "https://www.shorelinevision.com/wp-content/uploads/blog-woman-heart-hands.jpg",
        "published_date": "June 24, 2019",
        "author": "Reva Zemlak",
        "details": " With the fall semester quickly coming to a close, cramming for exams can affect more than bedtime routines (or lack thereof). Sustained hours spent studying and researching can have a significant effect on how your eyes feel, particularly when the work is performed on a computer or other digital device. First things first: If you are experiencing a sudden change in your vision, have eye pain, or significant redness, make an appointment with your eye care professional right away to identify the cause. However, if you’ve been spending long hours on schoolwork, and are experiencing symptoms such as eye strain, headaches, blurred vision, dry eyes, and neck and shoulder pain, you may have computer vision syndrome, also known as digital eye fatigue.1 Digital eye fatigue is due, in part, to the reduced blink rate that is common with computer use. Digital device usage has increased substantially in recent years—both in and out of the classroom.2 According to The Vision Council, more than 83 percent of Americans report using digital devices for more than two hours per day and more than 60 percent experience symptoms of eye strain. If you’d rather opt for contact lenses, Biofinity Energys™ are designed for all-day wear, so you don’t have to switch eye glasses’ prescriptions throughout the day. If you’re a contact lens wearer who frequently uses a digital device, Biofinity Energys™ contact lenses with Digital Zone Optics™ lens design can help eyes better adapt so they can seamlessly and continuously shift focus between digital devices and offline activities. Fortunately, visual fatigue doesn’t have to stand between you and your GPA (grades). Here are several strategies that can help ease your discomfort."
    },
    {
        "blog_id": 1493,
        "title": "Top 5 Questions to Ask Your Eye Doctor",
        "thumbnail": "https://www.shorelinevision.com/wp-content/uploads/shutterstock_490160671.jpg",
        "published_date": "June 24, 2019",
        "author": "Deja Reichert",
        "details": " Sight is one of our most valued senses, which is why it’s so important to visit your eye doctor regularly to ensure that your eyes stay healthy. There may be as long as a year or more between visits so it’s so important to make the most of your time with your eye doctor. After all, you don’t want to wait another year to ask a question that came to mind ten minutes after your last appointment ended. Every patient has a unique set of concerns, so you’ll want to develop a list of questions about topics that matter to you, but here are five important questions that are relevant to almost everyone.    f your doctor hasn’t already spoken with you about eye safety, this question will likely initiate a conversation about topics including protective eyewear, contact lens care, ultraviolet (UV) light and more. Notably, more than 2,000 workers experience some form of medical treatment due to work-related eye injuries every day in the U.S. alone, according to the Centers for Disease Control.7 Talk to your doctor about your workplace conditions to decide if special eyewear is warranted. You should also take precautions against UV. Several eye problems have been linked to UV exposure, including cataracts, macular degeneration, pingueculae, pterygia, photokeratitis, cancers of the eye and surrounding skin, and more. Sunglasses are your eyes’ best defense, but studies have shown that UV-blocking contact lenses can help block the peripheral light that sunglasses can't block.89 If you are a contact lens wearer, always replace your lenses as prescribed by your doctor and follow the required care and cleaning regimen. If you sometimes fall asleep in your lenses, ask about continuous wear options. Or, if you don’t want the hassle of rubbing and rinsing your lenses each night, enquire about 1 day disposable lenses. Your eye care professional will determine how often you need an exam based on your age, vision and medical history. Staying on schedule is important for you and for your loved ones. Many offices will schedule your next appointment right way. If not, set a reminder in your phone. Also, if your spouse, child or parent under your care sees the same doctor as you do, don’t leave the office without making sure their exams are on the books too."
    },
    {
        "blog_id": 1494,
        "title": "How Makeup Users Can Prevent Eye Health Problems",
        "thumbnail": "https://eyecareplus.com/wp-content/uploads/2020/07/EyecarePlus-Homepage2020-Body-Image02.jpg",
        "published_date": "July 09, 2018",
        "author": "Lexus Cronin",
        "details": " Beauty is important to lots of people. Beauty lovers can spend a tremendous amount of time and money trying to spruce up their looks, often by applying makeup. But if makeup is not used appropriately near the eyes, it can lead to some pretty unpleasant consequences—including infection, allergic reactions, or injury1—regardless of whether or not you’re being careful.  Developing an eye infection defeats the purpose of wearing makeup in the first place. After all, there’s nothing pleasant about a puffy, red eye. You can avoid this by following some basic rules and applying common sense to your makeup routine. If cosmetics are used for longer than recommended, bacteria and fungi can grow. Cosmetics should be discarded and replaced according to manufacturer recommendations—commonly every three months for mascara.2 Write the purchase date on the packaging to keep track of the dates. Sharing cosmetics, including the use of tester products in stores, is another potential avenue for introducing infection. One of the most common infections transmitted via makeup is conjunctivitis, which is inflammation of the membrane that covers the inner surface of the eyelid and the outer surface of the eye. Using disposable applicators may reduce the risk of transmission; however, bacteria and fungi may still be present in the cosmetic container if it is not wiped clean between uses. Not all reactions to makeup are caused by infection. Sometimes, allergies can be the culprit. Common allergens found in cosmetics include nickel, iron oxide, and ingredients found in preservatives and fragrances."
    },
    {
        "blog_id": 1495,
        "title": "Does Summer Air Quality Affect Your Eyes?",
        "thumbnail": "https://advancedeyekeller.com/wp-content/uploads/2021/02/eye-exam-for-contact-lenses-advaced-eye-clinic-intexas75.jpg",
        "published_date": "June 13, 2018",
        "author": "Nadia Ernser",
        "details": " All over the world, air quality reports are often included in the day’s weather forecast—especially during the summer months, when ozone levels can spike. Although it may bother some people more than others, the eye is vulnerable to the effects of air pollution,1 which means air quality can certainly impact how comfortable your eyes feel. And, depending on how polluted the air is, it can affect your quality of life—particularly when it leads to irritation while you’re wearing your contact lenses. When scientists talk about smog and air pollution, they’re often referring to too much ozone, which seems like a contradiction. After all, ozone forms a protective layer that shields us from the sun’s harmful ultraviolet rays.2 In other words, ozone is a good thing, right? Yes and no. Ozone can be good or bad, depending on where it is found. Ozone is an odorless, colorless gas that occurs both in the Earth’s upper atmosphere and at ground level.2 In the Earth’s lower atmosphere, near ground level, ozone is not formed naturally. Rather, it is formed when pollutants emitted by cars, power plants, industrial boilers, refineries, chemical plants, and other sources react chemically in the presence of sunlight.2 This ground-levelIf cosmetics are used for longer than recommended, bacteria and fungi can grow. Cosmetics should be discarded and replaced according to manufacturer recommendations—commonly every three months for mascara.2 Write the purchase date on the packaging to keep track of the dates. Sharing cosmetics, including the use of tester products in stores, is another potential avenue for introducing infection. One of the most common infections transmitted via makeup is conjunctivitis, which is inflammation of the membrane that covers the inner surface of the eyelid and the outer surface of the eye. Using disposable applicators may reduce the risk of transmission; however, bacteria and fungi may still be present in the cosmetic container if it is not wiped clean between uses. Not all reactions to makeup are caused by infection. Sometimes, allergies can be the culprit. Common allergens found in cosmetics include nickel, iron oxide, and ingredients found in preservatives and fragrances."
    },
    {
        "blog_id": 1496,
        "title": "Affect Your Eyes Does Summer Air Quality?",
        "thumbnail": "https://www.shorelinevision.com/wp-content/uploads/shutterstock_669787777.jpg",
        "published_date": "June 19, 2018",
        "author": "Eroma Ernser",
        "details": "One of the most common infections transmitted via makeup is conjunctivitis, which is inflammation of the membrane that covers the inner surface of the eyelid and the outer surface of the eye. Using disposable applicators may reduce the risk of transmission; however, bacteria and fungi may still be present in the cosmetic container if it is not wiped clean between uses. Not all reactions to makeup are caused by infection. Sometimes, allergies can be the culprit. Common allergens found in cosmetics include nickel, iron oxide, and ingredients found in preservatives and fragrances."
    },
    {
        "blog_id": 1497,
        "title": "Ultraviolet Radiation and Your Eyes",
        "thumbnail": "https://www.shorelinevision.com/wp-content/uploads/woman-covering-her-eye-in-discomfort.jpg",
        "published_date": "June 25, 2018",
        "author": "Jacynthe Runolfsdottir",
        "details": "Rather, it is formed when pollutants emitted by cars, power plants, industrial boilers, refineries, chemical plants, and other sources react chemically in the presence of sunlight.2 This ground-levelIf cosmetics are used for longer than recommended, bacteria and fungi can grow. Cosmetics should be discarded and replaced according to manufacturer recommendations—commonly every three months for mascara.2 Write the purchase date on the packaging to keep track of the dates. Sharing cosmetics, including the use of tester products in stores, is another potential avenue for introducing infection. One of the most common infections transmitted via makeup is conjunctivitis, which is inflammation of the membrane that covers the inner surface of the eyelid and the outer surface of the eye. Using disposable applicators may reduce the risk of transmission; however, bacteria and fungi may still be present in the cosmetic container if it is not wiped clean between uses. Not all reactions to makeup are caused by infection. Sometimes."
    },
    {
        "blog_id": 1498,
        "title": "Ultraviolet Radiation and Your Eyes",
        "thumbnail": "https://www.shorelinevision.com/wp-content/uploads/blog-amd.jpg",
        "published_date": "June 27, 2019",
        "author": "Marian Schmitt",
        "details": "One of the most common infections transmitted via makeup is conjunctivitis, which is inflammation of the membrane that covers the inner surface of the eyelid and the outer surface of the eye. Using disposable applicators may reduce the risk of transmission; however, bacteria and fungi may still be present in the cosmetic container if it is not wiped clean between uses. Not all reactions to makeup are caused by infection. Sometimes.Rather, it is formed when pollutants emitted by cars, power plants, industrial boilers, refineries, chemical plants, and other sources react chemically in the presence of sunlight.2 This ground-levelIf cosmetics are used for longer than recommended, bacteria and fungi can grow. Cosmetics should be discarded and replaced according to manufacturer recommendations—commonly every three months for mascara.2 Write the purchase date on the packaging to keep track of the dates. Sharing cosmetics, including the use of tester products in stores, is another potential avenue for introducing infection. "
    },
    {
        "blog_id": 1499,
        "title": "Three Ways to Slow Down Myopia",
        "thumbnail": "https://www.shorelinevision.com/wp-content/uploads/woman-at-work-1080x675-1.jpg",
        "published_date": "July 07, 2021",
        "author": "Shyanne Miller",
        "details": "If cosmetics are used for longer than recommended, bacteria and fungi can grow. Cosmetics should be discarded and replaced according to manufacturer recommendations—commonly every three months for mascara.2 Write the purchase date on the packaging to keep track of the dates. Sharing cosmetics, including the use of tester products in stores, is another potential avenue for introducing infection. One of the most common infections transmitted via makeup is conjunctivitis, which is inflammation of the membrane that covers the inner surface of the eyelid and the outer surface of the eye. Using disposable applicators may reduce the risk of transmission; however, bacteria and fungi may still be present in the cosmetic container if it is not wiped clean between uses. Not all reactions to makeup are caused by infection."
    }
]